tap "adoptopenjdk/openjdk"
tap "coursier/formulas"
tap "cowbell/stuff", "git@git.realestate.com.au:cowbell/homebrew-stuff.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "saadparwaiz1/personal"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq", link: true
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Build tool for Scala projects
brew "sbt"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Authenticate to REA AWS accounts
brew "cowbell/stuff/rea-as"
# Language Server For Lua
brew "saadparwaiz1/personal/lua-language-server"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# Application launcher and productivity software
cask "alfred"
# App to build and share containerized applications and microservices
cask "docker"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Wipr", id: 1320666476
