tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Vi 'workalike' with many additional features
brew "vim"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application uninstaller
cask "appcleaner"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video game digital distribution service
cask "steam"
# Video communication and virtual meeting platform
cask "zoom"
mas "Things", id: 904280696
mas "Wipr", id: 1320666476
