tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
brew "ack"
brew "cmake"
brew "composer"
brew "ctags"
brew "diff-so-fancy"
brew "direnv"
brew "exercism"
brew "fzf"
brew "git"
brew "git-lfs"
brew "go"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mariadb"
brew "mas"
brew "pandoc"
brew "php"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "thoughtbot/formulae/rcm"
cask "1password"
cask "adoptopenjdk11"
cask "alfred"
cask "appcleaner"
cask "dash"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-cascadia"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-chrome-canary"
cask "iina"
cask "imageoptim"
cask "insomnia"
cask "iterm2-beta"
cask "kaleidoscope"
cask "mactex"
cask "microsoft-remote-desktop-beta"
cask "notion"
cask "numi"
cask "pocket-casts"
cask "safari-technology-preview"
cask "sequel-pro-nightly"
cask "sketch"
cask "steam"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Grammarly for Safari", id: 1462114288
mas "Harvest", id: 506189836
mas "Icon Set Creator", id: 939343785
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ToothFairy", id: 1191449274
mas "Trello", id: 1278508951
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
