tap "enigmaticdb/super-secret-tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Text, code, and markup editor
cask "bbedit"
# Record and process your ideas
cask "bike"
# Download, solve, and print crossword puzzles
cask "black-ink"
# E-books management software
cask "calibre"
# The Homebrew Companion
cask "cork"
# API documentation browser and code snippet manager
cask "dash"
# Web browser
cask "firefox"
cask "font-fira-mono"
# Sans-serif typeface
cask "font-geist"
# Monospaced typeface designed to be used where code is represented
cask "font-geist-mono"
# Corporate typeface for IBM
cask "font-ibm-plex-mono"
cask "font-input"
# Expressive monospaced font family
cask "font-intel-one-mono"
# Variable font designed for display
cask "font-inter"
# Typeface made for developers
cask "font-jetbrains-mono"
# Mona Sans, a variable font from GitHub
cask "font-mona-sans"
# Superfamily of fonts for code
cask "font-monaspace"
cask "font-nunito"
cask "font-roboto-mono"
cask "font-source-code-pro"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Software for Logitech devices
cask "logi-options-plus"
# Tool to create text-based art
cask "monodraw"
# Native code editor
cask "nova"
# WebKit based web browser
cask "orion"
# Workflow application to improve productivity
cask "pastebot"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
mas "1Password for Safari", id: 1569813296
mas "Flighty", id: 1358823008
mas "Ivory", id: 6444602274
mas "Kagi Inc.", id: 1622835804
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Little Snitch Mini", id: 1629008763
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Play", id: 1596506190
mas "Save to Reader", id: 1640236961
mas "Sketch", id: 1667260533
mas "Things", id: 904280696
mas "Wipr", id: 1320666476
mas "Yomu", id: 562211012
mas "‎WhatsApp", id: 310633997
