tap "enigmaticdb/super-secret-tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "reainternal/stable", "git@git.realestate.com.au:cowbell/homebrew-stuff"
# Mozilla CA certificate store
brew "ca-certificates"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Diff that understands syntax
brew "difftastic"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq", link: true
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Encrypt and decrypt secrets using the AWS Key Management Service
brew "shush"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Vim script Language Lint
brew "vint"
# Linter for YAML files
brew "yamllint"
# Authenticate to REA AWS accounts
brew "reainternal/stable/rea-as"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Menu bar icon organizer
cask "bartender"
# Text, code, and markup editor
cask "bbedit"
# Display management tool
cask "betterdisplay"
# Record and process your ideas
cask "bike"
# Screen capturing tool
cask "cleanshot"
# The Homebrew Companion
cask "cork"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-fira-mono"
# Sans-serif typeface
cask "font-geist"
# Monospaced typeface designed to be used where code is represented
cask "font-geist-mono"
# Corporate typeface for IBM
cask "font-ibm-plex-mono"
cask "font-input"
# Expressive monospaced font family
cask "font-intel-one-mono"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-roboto-mono"
cask "font-source-code-pro"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Open-source keystroke visualizer
cask "keycastr"
# Software for Logitech devices
cask "logi-options-plus"
# Optimize your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Screen and video recording software
cask "loom"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office-businesspro"
# Tool to create text-based art
cask "monodraw"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Native code editor
cask "nova"
# WebKit based web browser
cask "orion"
# Podcast platform
cask "pocket-casts"
# GUI client for PostgreSQL databases
cask "postico"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Emoji picker optimized for blind people
cask "rocket"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Agenda", id: 1287445660
mas "Bear", id: 1091189122
mas "Dato", id: 1470584107
mas "Display Menu", id: 549083868
mas "Hand Mirror", id: 1502839586
mas "Hush", id: 1544743900
mas "Ivory", id: 6444602274
mas "Kagi Inc.", id: 1622835804
mas "Keynote", id: 409183694
mas "LanguageTool", id: 1534275760
mas "LastPass", id: 926036361
mas "MarkEdit", id: 1669953820
mas "NepTunes", id: 1006739057
mas "Numbers", id: 409203825
mas "OpenIn", id: 1643649331
mas "Parcel", id: 639968404
mas "Play", id: 1596506190
mas "Save to Reader", id: 1640236961
mas "Subscriptions", id: 1577082754
mas "Things", id: 904280696
mas "Velja", id: 1607635845
mas "Wipr", id: 1320666476
