tap "ankitpokhrel/jira-cli"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "reainternal/stable", "git@git.realestate.com.au:cowbell/homebrew-stuff"
# Mozilla CA certificate store
brew "ca-certificates"
# GNU multiple precision arithmetic library
brew "gmp"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Vim script Language Lint
brew "vint"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# 🔥 Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
# Authenticate to REA AWS accounts
brew "reainternal/stable/rea-as"
# Encrypt and decrypt secrets using AWS KMS
brew "reainternal/stable/shush"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Menu bar icon organizer
cask "bartender"
# Screen capturing tool
cask "cleanshot"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-fira-mono"
# Corporate typeface for IBM
cask "font-ibm-plex-mono"
cask "font-input"
# Expressive monospaced font family
cask "font-intel-one-mono"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-roboto-mono"
cask "font-source-code-pro"
# Web browser
cask "google-chrome"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Software for Logitech devices
cask "logi-options-plus"
# Optimize your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Screen and video recording software
cask "loom"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office-businesspro"
# Media player based on MPlayer and mplayer2
cask "mpv"
# WebKit based web browser
cask "orion"
# Podcast platform
cask "pocket-casts"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Display Menu", id: 549083868
mas "Ivory", id: 6444602274
mas "Kagi Inc.", id: 1622835804
mas "Keynote", id: 409183694
mas "LanguageTool", id: 1534275760
mas "LastPass", id: 926036361
mas "MarkEdit", id: 1669953820
mas "NepTunes", id: 1006739057
mas "Numbers", id: 409203825
mas "OpenIn", id: 1643649331
mas "Parcel", id: 639968404
mas "Subscriptions", id: 1577082754
mas "Things", id: 904280696
mas "Wipr", id: 1320666476
