akamud.vscode-theme-onedark
auiworks.amvim
aws-scripting-guy.cform
bungcip.better-toml
christian-kohler.npm-intellisense
codezombiech.gitignore
CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
deerawan.vscode-dash
donjayamanne.githistory
ecmel.vscode-html-css
EditorConfig.EditorConfig
eg2.vscode-npm-script
esbenp.prettier-vscode
fallenwood.vimL
faustinoaq.lex-flex-yacc-bison
felixfbecker.php-debug
felixfbecker.php-intellisense
flowtype.flow-for-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
GitHub.vscode-pull-request-github
ikappas.phpcs
jock.svg
kumar-harsh.graphql-for-vscode
leizongmin.node-module-intellisense
mauve.terraform
mikestead.dotenv
mrmlnc.vscode-apache
mrmlnc.vscode-puglint
mrmlnc.vscode-stylefmt
ms-python.python
ms-vscode.cpptools
ms-vscode.Go
msjsdiag.debugger-for-chrome
Orta.vscode-jest
PeterJausovec.vscode-docker
rebornix.ruby
redhat.vscode-yaml
sdras.night-owl
shinnn.stylelint
sysoev.language-stylus
vtfn.stylint
waderyan.gitblame
WakaTime.vscode-wakatime
wayou.vscode-todo-highlight
wix.vscode-import-cost
zhuangtongfa.Material-theme
