CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
EditorConfig.EditorConfig
GrapeCity.gc-excelviewer
James-Yu.latex-workshop
Orta.vscode-jest
PeterJausovec.vscode-docker
WakaTime.vscode-wakatime
auiworks.amvim
bungcip.better-toml
castwide.solargraph
christian-kohler.npm-intellisense
codezombiech.gitignore
dbaeumer.vscode-eslint
dbankier.vscode-instant-markdown
deerawan.vscode-dash
donjayamanne.githistory
dracula-theme.theme-dracula
ecmel.vscode-html-css
eg2.vscode-npm-script
esbenp.prettier-vscode
fallenwood.vimL
felixfbecker.php-debug
felixfbecker.php-intellisense
flowtype.flow-for-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
jock.svg
leizongmin.node-module-intellisense
mauve.terraform
mrmlnc.vscode-puglint
mrmlnc.vscode-stylefmt
ms-vscode.Go
msjsdiag.debugger-for-chrome
rebornix.Ruby
sdras.night-owl
shinnn.stylelint
streetsidesoftware.code-spell-checker
sysoev.language-stylus
vtfn.stylint
waderyan.gitblame
wayou.vscode-todo-highlight
wix.vscode-import-cost
yzane.markdown-pdf
zxh404.vscode-proto3
