atlassian.atlascode
aws-scripting-guy.cform
dbaeumer.vscode-eslint
EditorConfig.EditorConfig
esbenp.prettier-vscode
flowtype.flow-for-vscode
GitHub.vscode-pull-request-github
HaaLeo.vscode-stylint
ikappas.phpcs
mikestead.dotenv
ms-azuretools.vscode-docker
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.vscode-react-native
onecentlin.laravel-blade
Orta.vscode-jest
rebornix.ruby
redhat.vscode-yaml
shinnn.stylelint
sysoev.language-stylus
WakaTime.vscode-wakatime
wix.vscode-import-cost
