tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "reainternal/stable", "git@git.realestate.com.au:cowbell/homebrew-stuff"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# GitHub command-line tool
brew "gh"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Vim script Language Lint
brew "vint"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
# Authenticate to REA AWS accounts
brew "reainternal/stable/rea-as"
# Encrypt and decrypt secrets using AWS KMS
brew "reainternal/stable/shush"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Menu bar icon organizer
cask "bartender"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Expressive monospaced font family
cask "font-intel-one-mono"
# Typeface made for developers
cask "font-jetbrains-mono"
# Web browser
cask "google-chrome"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Clipboard manager
cask "jumpcut"
# Software for Logitech devices
cask "logi-options-plus"
# Software for Logitech devices
cask "logitech-options"
# Optimize your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Screen and video recording software
cask "loom"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office-businesspro"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Open-source software for live streaming and screen recording
cask "obs"
# Podcast platform
cask "pocket-casts"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Video communication and virtual meeting platform
cask "zoom"
mas "Display Menu", id: 549083868
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "MarkEdit", id: 1669953820
mas "NepTunes", id: 1006739057
mas "Parcel", id: 639968404
mas "Things", id: 904280696
